Fri3dCamp/badge_firmware/boards/fox/sdkconfig.defaults
# Platform configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FRI3D_BADGE_FOX=y

# TODO: we might want to make this build type dependent
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# Convenience for development
# CONFIG_FRI3D_LOG_DEBUG=y
# CONFIG_FRI3D_LOG_VERBOSE=y

# Increase stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10000
